eu.alert-project.iccs.events.core/src/test/resources/ALERT.KEUI.IssueNew.Annotated.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope  xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
            xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <soap:Header ></soap:Header >
    <soap:Body >
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic></wsnt:Topic>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
                </wsnt:ProducerReference>
                <wsnt:Message>
                    <ns1:event xmlns:ns1="http://www.alert-project.eu/"
                               xmlns:o="http://www.alert-project.eu/ontoevents-mdservice"
                               xmlns:r="http://www.alert-project.eu/rawevents-forum"
                               xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist"
                               xmlns:r2="http://www.alert-project.eu/rawevents-wiki"
                               xmlns:s="http://www.alert-project.eu/strevents-kesi"
                               xmlns:s1="http://www.alert-project.eu/strevents-keui"
                               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                               xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
                        <ns1:head>
                            <ns1:sender>METADATASERVICE</ns1:sender>
                            <ns1:timestamp>10003</ns1:timestamp>
                            <ns1:sequencenumber>1</ns1:sequencenumber>
                        </ns1:head>
                        <ns1:payload>
                            <ns1:meta>
                                <ns1:startTime>10010</ns1:startTime>
                                <ns1:endTime>10020</ns1:endTime>
                                <ns1:eventName>ALERT.Metadata.IssueNew.Stored</ns1:eventName>
                                <ns1:eventId>5748</ns1:eventId>
                                <ns1:eventType>reply</ns1:eventType>
                            </ns1:meta>
                            <ns1:eventData>
                                <s:issue>
                                    <!-- issue id -->
                                    <s:issueId>332</s:issueId>

                                    <!-- issue URL -->
                                    <s:issueUrl>https://bugzilla.libresoft.es/show_bug.cgi?id=332</s:issueUrl>

                                    <!-- ids of related issues -->
                                    <s:issueDependsOnId>10001</s:issueDependsOnId>
                                    <s:issueBlocksId>20001</s:issueBlocksId>

                                    <!-- tracker -->
                                    <s:issueTracker>
                                        <s:issueTrackerType>bugzilla</s:issueTrackerType>
                                        <s:issueTrackerURL>https://bugzilla.libresoft.es/</s:issueTrackerURL>
                                    </s:issueTracker>

                                    <!-- id of issue author person -->
                                    <s:issueAuthor>
                                        <s:email>lcanas</s:email>
                                        <s:name>Luis Cañas Díaz</s:name>
                                        <s:id>lcanas</s:id>
                                    </s:issueAuthor>

                                    <!-- issue status (Assigned, Open, Verified, Resolved, Closed) -->
                                    <s:issueStatus>Open</s:issueStatus>

                                    <!-- issue resolution (Duplicate, Fixed, Invalid, ThirdParty, WontFix, WorksForMe, Later, Remind) -->
                                    <s:issueResolution/>

                                    <s:issueSummary>Second fake bug</s:issueSummary>
                                    <s:issueDescription>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</s:issueDescription>

                                    <!-- date time in format yyyy-MM-dd HH:mm -->
                                    <s:issueDateOpened>2012-03-16T00:00:00+01:00</s:issueDateOpened>

                                    <s:issueAssignedTo>
                                        <s:email>lcanas</s:email>
                                        <s:name>Luis Cañas</s:name>
                                        <s:id>lcanas</s:id>
                                    </s:issueAssignedTo>

                                    <s:issueCCPerson>
                                        <s:email>sduenas</s:email>
                                        <s:name>Santiago Dueñas</s:name>
                                        <s:id>sduenas</s:id>
                                    </s:issueCCPerson>

                                    <!-- issue priority (1 - 5) -->
                                    <s:issuePriority>3</s:issuePriority>

                                    <!-- issue severity (Blocker, Critical, Major, Minor, Trivial, Feature) -->
                                    <s:issueSeverity>Normal</s:issueSeverity>

                                    <s:issueProduct>
                                        <s:productComponentId>fake-component</s:productComponentId>
                                        <s:productId>Kesi-tester</s:productId>
                                        <s:productVersion>unspecified</s:productVersion>
                                    </s:issueProduct>

                                    <s:issueComputerSystem>
                                        <!-- id of computer system -->
                                        <s:computerSystemId></s:computerSystemId>
                                        <!-- computer system platform -->
                                        <s:computerSystemPlatform>Ubuntu Packages</s:computerSystemPlatform>
                                        <!-- computer system OS -->
                                        <s:computerSystemOS>Linux</s:computerSystemOS>
                                    </s:issueComputerSystem>

                                    <!-- keywords -->
                                    <s:issueKeyword/>

                                    <s:issueMilestone>
                                        <!-- id of milestone -->
                                        <s:milestoneId></s:milestoneId>
                                        <s:milestoneTarget></s:milestoneTarget>
                                    </s:issueMilestone>
                                </s:issue>
                                <o:mdservice>
                                    <o:issueUri>http://www.alert-project.eu/ontologies/alert_its.owl#Bug1</o:issueUri>
                                    <o:issueAuthorUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person1
                                    </o:issueAuthorUri>
                                    <o:issueProduct>
                                        <o:productUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Product1
                                        </o:productUri>
                                        <o:productComponentUri>
                                            http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Component1
                                        </o:productComponentUri>
                                    </o:issueProduct>
                                    <o:issueComputerSystem>
                                        <o:issueComputerSystemUri>
                                            http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#ComputerSystem1
                                        </o:issueComputerSystemUri>
                                    </o:issueComputerSystem>
                                    <o:issueAssignedToUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person2
                                    </o:issueAssignedToUri>
                                    <o:issueCCPersonUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person3
                                    </o:issueCCPersonUri>
                                    <o:issueDependsOnUri>http://www.alert-project.eu/ontologies/alert_its.owl#Bug2
                                    </o:issueDependsOnUri>
                                    <o:issueBlocksUri>http://www.alert-project.eu/ontologies/alert_its.owl#Bug3
                                    </o:issueBlocksUri>
                                    <o:issueComment>
                                        <o:commentUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Comment1
                                        </o:commentUri>
                                        <o:commentPersonUri>
                                            http://www.alert-project.eu/ontologies/alert_scm.owl#Person1
                                        </o:commentPersonUri>
                                    </o:issueComment>
                                    <o:issueAttachment>
                                        <o:attachmentUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Attachment1
                                        </o:attachmentUri>
                                    </o:issueAttachment>
                                    <o:issueTracker>
                                        <o:issueTrackerUri>
                                            http://www.alert-project.eu/ontologies/alert_its.owl#IssueTracker1
                                        </o:issueTrackerUri>
                                    </o:issueTracker>
                                </o:mdservice>

                                <s1:keui>
                                    <s1:issueDescriptionAnnotated>
                                        <![CDATA[Notify <concept id="KDE/user">user</concept> on <concept id="http://ailab.ijs.si/alert/resource/r364">hardware</concept> changes <concept id="http://ailab.ijs.si/alert/resource/r17814">2</concept>]]></s1:issueDescriptionAnnotated>
                                    <s1:issueDescriptionConcepts>
                                        <s1:concept>
                                            <s1:uri>KDE/user</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>http://ailab.ijs.si/alert/resource/r364</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>http://ailab.ijs.si/alert/resource/r17814</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                    </s1:issueDescriptionConcepts>
                                    <s1:commentTextAnnotated>
                                        <![CDATA[<concept id="http://ailab.ijs.si/alert/resource/r18520">Version</concept>: (using <concept id="KDE/KDE_4">KDE 4</concept>.<concept id="http://ailab.ijs.si/alert/resource/r17814">2</concept>.0) OS: <concept id="http://ailab.ijs.si/alert/resource/r14937">Linux</concept> <concept id="http://ailab.ijs.si/alert/resource/r18126">Installed</concept> from: <concept id="http://ailab.ijs.si/alert/resource/r18117">Ubuntu</concept> <concept id="http://ailab.ijs.si/alert/resource/r17650">Packages</concept> It would be awesome if <concept id="KDE/KDE">KDE</concept> notifies te <concept id="KDE/user">user</concept> of newly <concept id="http://ailab.ijs.si/alert/resource/r18126">installed</concept> <concept id="http://ailab.ijs.si/alert/resource/r364">hardware</concept>, missing <concept id="http://ailab.ijs.si/alert/resource/r17629">drivers</concept>, <concept id="KDE/programming">programs</concept> to use the connected <concept id="KDE/devices">device</concept>, etc.]]></s1:commentTextAnnotated>
                                    <s1:commentTextConcepts>
                                        <s1:concept>
                                            <s1:uri>http://ailab.ijs.si/alert/resource/r18520</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>KDE/KDE_4</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>http://ailab.ijs.si/alert/resource/r17814</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>http://ailab.ijs.si/alert/resource/r14937</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>http://ailab.ijs.si/alert/resource/r18126</s1:uri>
                                            <s1:weight>2</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>http://ailab.ijs.si/alert/resource/r18117</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>http://ailab.ijs.si/alert/resource/r17650</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>KDE/KDE</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>KDE/user</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>http://ailab.ijs.si/alert/resource/r364</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>http://ailab.ijs.si/alert/resource/r17629</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>KDE/programming</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                        <s1:concept>
                                            <s1:uri>KDE/devices</s1:uri>
                                            <s1:weight>1</s1:weight>
                                        </s1:concept>
                                    </s1:commentTextConcepts>
                                    <s1:itemId>7805</s1:itemId>
                                    <s1:threadId>12</s1:threadId>
                                </s1:keui>
                            </ns1:eventData>
                        </ns1:payload>
                    </ns1:event>
                </wsnt:Message>
            </wsnt:NotificationMessage>
        </wsnt:Notify>
    </soap:Body >
</soap:Envelope >